In [10]:
import pandas as pd
import numpy as np

In [4]:
pd.__version__

'0.24.2'

In [6]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit: None

pandas: 0.24.2
pytest: 4.3.1
pip: 19.0.3
setuptools: 40.8.0
Cython: 0.29.6
numpy: 1.16.2
scipy: 1.2.1
pyarrow: None
xarray: None
IPython: 7.4.0
sphinx: 1.8.5
patsy: 0.5.1
dateutil: 2.8.0
pytz: 2018.9
blosc: None
bottleneck: 1.2.1
tables: 3.5.1
numexpr: 2.6.9
feather: None
matplotlib: 3.0.3
openpyxl: 2.6.1
xlrd: 1.2.0
xlwt: 1.3.0
xlsxwriter: 1.1.5
lxml.etree: 4.3.2
bs4: 4.7.1
html5lib: 1.0.1
sqlalchemy: 1.3.1
pymysql: None
psycopg2: None
jinja2: 2.10
s3fs: None
fastparquet: None
pandas_gbq: None
pandas_datareader: 0.7.0
gcsfs: None

In [24]:
#creating dummy pd dataframe

df = pd.DataFrame({'col1':[100, 200], 'col2':[300, 400]
                })
df.head()

   col1  col2
0   100   300
1   200   400

In [11]:
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.946368,0.245510,0.721015,0.096285,0.845438,0.193539,0.808992,0.853253
1,0.894757,0.504648,0.739604,0.972872,0.735344,0.241424,0.695346,0.090394
2,0.102172,0.522796,0.826970,0.954024,0.065962,0.042094,0.276735,0.822990
3,0.728758,0.884864,0.039334,0.712670,0.938602,0.545690,0.508497,0.857845

In [13]:
pd.DataFrame(np.random.rand(4,8), columns=list('abcdefgh'))

,a,b,c,d,e,f,g,h
0,0.219512,0.164762,0.401272,0.926042,0.636610,0.260961,0.298771,0.535346
1,0.948249,0.663372,0.403594,0.580224,0.079292,0.252178,0.655512,0.784519
2,0.427550,0.103826,0.913146,0.692623,0.932690,0.107808,0.763633,0.393569
3,0.577121,0.689462,0.088197,0.910739,0.326459,0.323520,0.551745,0.709904

In [25]:
#rename column
df.rename({'col1': 'first_column','col2': 'second_column'}, axis = 'columns')

   first_column  second_column
0           100            300
1           200            400

In [27]:
# Another way of replacing column names
df.columns = ['col_one', 'col_two']
df.head()

   col_one  col_two
0      100      300
1      200      400

In [30]:
#Replacing all the column name with regex
df.columns = df.columns.str.replace('_', '$')
df

   col$one  col$two
0      100      300
1      200      400

In [33]:
#Adding index prefix to all the columns
df.add_prefix('x_')

TypeError: add_prefix() got an unexpected keyword argument 'inplace'

In [32]:
# Suffix all the column name with special patterns
df.add_suffix("_y")

   col$one_y  col$two_y
0        100        300
1        200        400

In [34]:
# Data sample for the example
#movies = pd.read_csv('http://bit.ly/imdbratings')
#orders = pd.read_csv('http://bit.ly/chiporders', sep='\t')
#orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')
#stocks = pd.read_csv('http://bit.ly/smallstocks', parse_dates=['Date'])
#titanic = pd.read_csv('http://bit.ly/kaggletrain')
#ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])

In [40]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [41]:
#Reverse row order
drinks.loc[::-1].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
192,Zimbabwe,64,18,4,4.7,Africa
191,Zambia,32,19,4,2.5,Africa
190,Yemen,6,0,0,0.1,Asia
189,Vietnam,111,2,1,2.0,Asia
188,Venezuela,333,100,3,7.7,South America

In [44]:
#reindex the reversed df
drinks.loc[::-1].reset_index(drop=True).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Zimbabwe,64,18,4,4.7,Africa
1,Zambia,32,19,4,2.5,Africa
2,Yemen,6,0,0,0.1,Asia
3,Vietnam,111,2,1,2.0,Asia
4,Venezuela,333,100,3,7.7,South America

In [45]:
# Reversing column order
drinks.loc[:,::-1].head()

,continent,total_litres_of_pure_alcohol,wine_servings,spirit_servings,beer_servings,country
0,Asia,0.0,0,0,0,Afghanistan
1,Europe,4.9,54,132,89,Albania
2,Africa,0.7,14,0,25,Algeria
3,Europe,12.4,312,138,245,Andorra
4,Africa,5.9,45,57,217,Angola

In [46]:
#Pandas listing data type
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [48]:
# This to select the columns which is having 
# only number types (int64 and float64)
drinks.select_dtypes(include='number').head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

In [51]:
drinks.select_dtypes(include='object').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [53]:
#Selecting multiple column types
drinks.select_dtypes(include=['number', 'object']).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [55]:
#Using exclude example
drinks.select_dtypes(exclude='object').head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

In [61]:
#Creating dummy dataframe
df = pd.DataFrame({'col_one':['1', '2', '3.3'],
                   'col_two':['4.4', '5.5', '6.6'],
                   'col_three':['7.7', '8.8', '-']})
df

  col_one col_two col_three
0       1     4.4       7.7
1       2     5.5       8.8
2     3.3     6.6         -

In [62]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [66]:
df.astype({'col_one':'float', 'col_two':'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

In [69]:
# Using Pandas you can convert a specific column 
# Numeric if data is not an number NaN will be filled
pd.to_numeric(df.col_three, errors='coerce')

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

In [72]:
# Filling NaN with 0 value or any default value
pd.to_numeric(df.col_three, errors='coerce').fillna(0)

  col_one col_two col_three
0       1     4.4       7.7
1       2     5.5       8.8
2     3.3     6.6         -

In [74]:
#Alternatively 
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)
df

   col_one  col_two  col_three
0      1.0      4.4        7.7
1      2.0      5.5        8.8
2      3.3      6.6        0.0

In [ ]:
# Reduce  DataFrame size
# pandas dataframe are designe to fit into memory, and so somtimes
# you need to reduce the DataFrame size 
# https://nbviewer.jupyter.org/github/justmarkham/pandas-videos/blob/master/top_25_pandas_tricks.ipynb